I-SYST/EHAL/ARM/ST/STM32L0xx/include/stm32l0xxxxx.h
/**
  ******************************************************************************
  * @file    $PRODUCTNAME_LC$.h
  * @author  MCD Application Team
  * @brief   CMSIS Cortex-M0+ Device Peripheral Access Layer Header File. 
  *          This file contains all the peripheral register's definitions, bits 
  *          definitions and memory mapping for $PRODUCTNAME_LC$ devices.  
  *          
  *          This file contains:
  *           - Data structures and the address mapping for all peripherals
  *           - Peripheral's registers declarations and bits definition
  *           - Macros to access peripheral's registers hardware
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2016 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/** @addtogroup CMSIS
  * @{
  */

/** @addtogroup $PRODUCTNAME_LC$
  * @{
  */
    
#ifndef __$PRODUCTNAME_UC$_H
#define __$PRODUCTNAME_UC$_H

#ifdef __cplusplus
 extern "C" {
#endif 
  

/** @addtogroup Configuration_section_for_CMSIS
  * @{
  */
/**
  * @brief Configuration of the Cortex-M0+ Processor and Core Peripherals 
  */
#define __CM0PLUS_REV             0 /*!< Core Revision r0p0                            */
#if $L011$ || $L021$ || $L031$ || $L041$
#define __MPU_PRESENT             0 /*!< STM32L0xx  provides no MPU                    */
#else
#define __MPU_PRESENT             1 /*!< STM32L0xx  provides an MPU                    */
#endif
#define __VTOR_PRESENT            1 /*!< Vector  Table  Register supported             */
#define __NVIC_PRIO_BITS          2 /*!< STM32L0xx uses 2 Bits for the Priority Levels */
#define __Vendor_SysTickConfig    0 /*!< Set to 1 if different SysTick Config is used  */

/**
  * @}
  */
   
/** @addtogroup Peripheral_interrupt_number_definition
  * @{
  */
   
/**
 * @brief $PRODUCTNAME_LC$ Interrupt Number Definition, according to the selected device 
 *        in @ref Library_configuration_section 
 */

/*!< Interrupt Number Definition */
typedef enum
{
/******  Cortex-M0 Processor Exceptions Numbers ******************************************************/
  NonMaskableInt_IRQn         = -14,    /*!< 2 Non Maskable Interrupt                                */
  HardFault_IRQn              = -13,    /*!< 3 Cortex-M0+ Hard Fault Interrupt                       */
  SVC_IRQn                    = -5,     /*!< 11 Cortex-M0+ SV Call Interrupt                         */
  PendSV_IRQn                 = -2,     /*!< 14 Cortex-M0+ Pend SV Interrupt                         */
  SysTick_IRQn                = -1,     /*!< 15 Cortex-M0+ System Tick Interrupt                     */

/******  STM32L-0 specific Interrupt Numbers *********************************************************/
  WWDG_IRQn                   = 0,      /*!< Window WatchDog Interrupt                               */
  PVD_IRQn                    = 1,      /*!< PVD through EXTI Line detect Interrupt                  */
  RTC_IRQn                    = 2,      /*!< RTC through EXTI Line Interrupt                         */
  FLASH_IRQn                  = 3,      /*!< FLASH Interrupt                                         */
#if $L011$ || $L021$ || $L031$ || $L041$ || $L051$ || $L061$ || $L071$ || $L081$
  RCC_IRQn                    = 4,      /*!< RCC Interrupt                                           */
#else
  RCC_CRS_IRQn                = 4,      /*!< RCC and CRS Interrupts                                  */
#endif
  EXTI0_1_IRQn                = 5,      /*!< EXTI Line 0 and 1 Interrupts                            */
  EXTI2_3_IRQn                = 6,      /*!< EXTI Line 2 and 3 Interrupts                            */
  EXTI4_15_IRQn               = 7,      /*!< EXTI Line 4 to 15 Interrupts                            */
#if $L052$ || $L053$ || $L062$ || $L063$ || $L072$ || $L073$ || $L082$ || $L083$
  TSC_IRQn                    = 8,      /*!< TSC Interrupt                                           */
#endif
  DMA1_Channel1_IRQn          = 9,      /*!< DMA1 Channel 1 Interrupt                                */
  DMA1_Channel2_3_IRQn        = 10,     /*!< DMA1 Channel 2 and Channel 3 Interrupts                 */
  DMA1_Channel4_5_6_7_IRQn    = 11,     /*!< DMA1 Channel 4, Channel 5, Channel 6 and Channel 7 Interrupts */
  ADC1_COMP_IRQn              = 12,     /*!< ADC1, COMP1 and COMP2 Interrupts                        */
  LPTIM1_IRQn                 = 13,     /*!< LPTIM1 Interrupt                                        */
#if $L071$ || $L072$ || $L073$ || $L081$ || $L082$ || $L083$
  USART4_5_IRQn               = 14,     /*!< USART4 and USART5 Interrupt                             */
#endif
  TIM2_IRQn                   = 15,     /*!< TIM2 Interrupt                                          */
#if $L071$ || $L072$ || $L073$ || $L081$ || $L082$ || $L083$
  TIM3_IRQn                   = 16,     /*!< TIM3 Interrupt                                          */
#endif
#if $L051$ || $L061$ || $L071$ || $L081$
  TIM6_IRQn                   = 17,     /*!< TIM6  Interrupt                                         */
#elif $L052$ || $L053$ || $L062$ || $L063$ || $L072$ || $L073$ || $L082$ || $L083$
  TIM6_DAC_IRQn               = 17,     /*!< TIM6 and DAC Interrupts                                 */
#endif
#if $L071$ || $L072$ || $L073$ || $L081$ || $L082$ || $L083$
  TIM7_IRQn                   = 18,     /*!< TIM7 Interrupt                                          */
#endif
  TIM21_IRQn                  = 20,     /*!< TIM21 Interrupt                                         */
#if $L071$ || $L072$ || $L073$ || $L081$ || $L082$ || $L083$
  I2C3_IRQn                   = 21,     /*!< I2C3 Interrupt                                          */
#endif
#if !$L011$ && !$L021$
  TIM22_IRQn                  = 22,     /*!< TIM22 Interrupt                                         */
#endif
  I2C1_IRQn                   = 23,     /*!< I2C1 Interrupt                                          */
#if $L051$ || $L052$ || $L053$ || $L061$ ||  $L062$ || $L063$ || $L071$ || $L072$ || $L073$ || $L081$ || $L082$ || $L083$
  I2C2_IRQn                   = 24,     /*!< I2C2 Interrupt                                          */
#endif
  SPI1_IRQn                   = 25,     /*!< SPI1 Interrupt                                          */
#if $L051$ || $L052$ || $L053$ || $L061$ ||  $L062$ || $L063$ || $L071$ || $L072$ || $L073$ || $L081$ || $L082$ || $L083$
  SPI2_IRQn                   = 26,     /*!< SPI2 Interrupt                                          */
#endif
#if $L051$ || $L052$ || $L053$ || $L061$ ||  $L062$ || $L063$ || $L071$ || $L072$ || $L073$ || $L081$ || $L082$ || $L083$
  USART1_IRQn                 = 27,     /*!< USART1 Interrupt                                        */
#endif
  USART2_IRQn                 = 28,     /*!< USART2 Interrupt                                        */
#if $L011$ || $L031$ || $L051$ || $L071$
  LPUART1_IRQn                = 29,     /*!< LPUART1 Interrupt                                       */
#elif $L052$ || $L053$ || $L072$ || $L073$
  RNG_LPUART1_IRQn            = 29,     /*!< RNG and LPUART1 Interrupts                              */
#elif $L021$ || $L041$ || $L061$ || $L081$
  AES_LPUART1_IRQn            = 29,     /*!< AES and LPUART1 Interrupts                              */
#elif $L062$ || $L063$ || $L082$ || $L083$
  AES_RNG_LPUART1_IRQn        = 29,     /*!< AES and RNG and LPUART1 Interrupts                      */
#else
#error
#endif
#if $L053$ || $L063$ || $L073$ || $L083$
  LCD_IRQn                    = 30,     /*!< LCD Interrupt                                           */
#endif
#if $L052$ || $L053$ || $L062$ || $L063$ || $L072$ || $L073$ || $L082$ || $L083$
  USB_IRQn                    = 31,     /*!< USB global Interrupt                                    */
#endif
} IRQn_Type;

/**
  * @}
  */

#include "core_cm0plus.h"
#include "system_stm32l0xx.h"
#include <stdint.h>

