I-SYST/EHAL/ARM/ST/STM32L0xx/include/stm32l0xxxxx.h
#define PERIPH_BASE            ((uint32_t)0x40000000U) /*!< Peripheral base address in the alias region */

/*!< Peripheral memory map */
#define APBPERIPH_BASE        PERIPH_BASE
#define AHBPERIPH_BASE        (PERIPH_BASE + 0x00020000U)
#define IOPPERIPH_BASE        (PERIPH_BASE + 0x10000000U)

#define TIM2_BASE             (APBPERIPH_BASE + 0x00000000U)
#if $L071$ || $L072$ || $L073$ || $L081$ || $L082$ || $L083$
#define TIM3_BASE             (APBPERIPH_BASE + 0x00000400U)
#endif
#if $L051$ || $L052$ || $L053$ || $L061$ ||  $L062$ || $L063$ || $L071$ || $L072$ || $L073$ || $L081$ || $L082$ || $L083$
#define TIM6_BASE             (APBPERIPH_BASE + 0x00001000U)
#endif
#if $L071$ || $L072$ || $L073$ || $L081$ || $L082$ || $L083$
#define TIM7_BASE             (APBPERIPH_BASE + 0x00001400U)
#endif
#if $L053$ || $L063$ || $L073$ || $L083$
#define LCD_BASE              (APBPERIPH_BASE + 0x00002400U)
#endif
#define RTC_BASE              (APBPERIPH_BASE + 0x00002800U)
#define WWDG_BASE             (APBPERIPH_BASE + 0x00002C00U)
#define IWDG_BASE             (APBPERIPH_BASE + 0x00003000U)
#if $L051$ || $L052$ || $L053$ || $L061$ ||  $L062$ || $L063$ || $L071$ || $L072$ || $L073$ || $L081$ || $L082$ || $L083$
#define SPI2_BASE             (APBPERIPH_BASE + 0x00003800U)
#endif
#define USART2_BASE           (APBPERIPH_BASE + 0x00004400U)
#define LPUART1_BASE          (APBPERIPH_BASE + 0x00004800U)
#if $L071$ || $L072$ || $L073$ || $L081$ || $L082$ || $L083$
#define USART4_BASE           (APBPERIPH_BASE + 0x00004C00U)
#define USART5_BASE           (APBPERIPH_BASE + 0x00005000U)
#endif
#define I2C1_BASE             (APBPERIPH_BASE + 0x00005400U)
#if $L051$ || $L052$ || $L053$ || $L061$ ||  $L062$ || $L063$ || $L071$ || $L072$ || $L073$ || $L081$ || $L082$ || $L083$
#define I2C2_BASE             (APBPERIPH_BASE + 0x00005800U)
#endif
#if $L052$ || $L053$ || $L062$ || $L063$ || $L072$ || $L073$ || $L082$ || $L083$
#define CRS_BASE              (APBPERIPH_BASE + 0x00006C00U)
#endif
#define PWR_BASE              (APBPERIPH_BASE + 0x00007000U)
#if $L052$ || $L053$ || $L062$ || $L063$ || $L072$ || $L073$ || $L082$ || $L083$
#define DAC_BASE              (APBPERIPH_BASE + 0x00007400U)
#endif
#define LPTIM1_BASE           (APBPERIPH_BASE + 0x00007C00U)
#if $L071$ || $L072$ || $L073$ || $L081$ || $L082$ || $L083$
#define I2C3_BASE             (APBPERIPH_BASE + 0x00007800U)
#endif

#define SYSCFG_BASE           (APBPERIPH_BASE + 0x00010000U)
#define COMP1_BASE            (APBPERIPH_BASE + 0x00010018U)
#define COMP2_BASE            (APBPERIPH_BASE + 0x0001001CU)
#define COMP12_COMMON       ((COMP_Common_TypeDef *) COMP1_BASE)
#define EXTI_BASE             (APBPERIPH_BASE + 0x00010400U)
#define TIM21_BASE            (APBPERIPH_BASE + 0x00010800U)
#if !$L011$ && !$L021$
#define TIM22_BASE            (APBPERIPH_BASE + 0x00011400U)
#endif
#if $L051$ || $L052$ || $L053$ || $L061$ ||  $L062$ || $L063$ || $L071$ || $L072$ || $L073$ || $L081$ || $L082$ || $L083$
#define FIREWALL_BASE         (APBPERIPH_BASE + 0x00011C00U)
#endif
#define ADC1_BASE             (APBPERIPH_BASE + 0x00012400U)
#define ADC_BASE              (APBPERIPH_BASE + 0x00012708U)
#define SPI1_BASE             (APBPERIPH_BASE + 0x00013000U)
#if $L051$ || $L052$ || $L053$ || $L061$ ||  $L062$ || $L063$ || $L071$ || $L072$ || $L073$ || $L081$ || $L082$ || $L083$
#define USART1_BASE           (APBPERIPH_BASE + 0x00013800U)
#endif
#define DBGMCU_BASE           (APBPERIPH_BASE + 0x00015800U)

#define DMA1_BASE             (AHBPERIPH_BASE + 0x00000000U)
#define DMA1_Channel1_BASE    (DMA1_BASE + 0x00000008U)
#define DMA1_Channel2_BASE    (DMA1_BASE + 0x0000001CU)
#define DMA1_Channel3_BASE    (DMA1_BASE + 0x00000030U)
#define DMA1_Channel4_BASE    (DMA1_BASE + 0x00000044U)
#define DMA1_Channel5_BASE    (DMA1_BASE + 0x00000058U)
#if !$L011$ && !$L021$
#define DMA1_Channel6_BASE    (DMA1_BASE + 0x0000006CU)
#define DMA1_Channel7_BASE    (DMA1_BASE + 0x00000080U)
#endif
#define DMA1_CSELR_BASE       (DMA1_BASE + 0x000000A8U)


#define RCC_BASE              (AHBPERIPH_BASE + 0x00001000U)
#define FLASH_R_BASE          (AHBPERIPH_BASE + 0x00002000U) /*!< FLASH registers base address */
#define OB_BASE               ((uint32_t)0x1FF80000U)        /*!< FLASH Option Bytes base address */
#define FLASHSIZE_BASE        ((uint32_t)0x1FF8007CU)        /*!< FLASH Size register base address */
#define UID_BASE              ((uint32_t)0x1FF80050U)        /*!< Unique device ID register base address  */
#define CRC_BASE              (AHBPERIPH_BASE + 0x00003000U)
#if $L052$ || $L053$ || $L062$ || $L063$ || $L072$ || $L073$ || $L082$ || $L083$
#define TSC_BASE              (AHBPERIPH_BASE + 0x00004000U)
#endif
#if $L052$ || $L053$ || $L062$ || $L063$ || $L072$ || $L073$ || $L082$ || $L083$
#define RNG_BASE              (AHBPERIPH_BASE + 0x00005000U)
#endif
#if $L021$ || $L041$ || $L061$ || $L062$ || $L063$ || $L081$ || $L082$ || $L083$
#define AES_BASE              (AHBPERIPH_BASE + 0x00006000U)
#endif

#define GPIOA_BASE            (IOPPERIPH_BASE + 0x00000000U)
#define GPIOB_BASE            (IOPPERIPH_BASE + 0x00000400U)
#define GPIOC_BASE            (IOPPERIPH_BASE + 0x00000800U)
#if $L051$ || $L052$ || $L053$ || $L061$ ||$L062$ || $L063$ || $L071$ || $L072$ || $L073$ || $L081$ || $L082$ || $L083$
#define GPIOD_BASE            (IOPPERIPH_BASE + 0x00000C00U)
#endif
#if $L071$ || $L072$ || $L073$ || $L081$ || $L082$ || $L083$
#define GPIOE_BASE            (IOPPERIPH_BASE + 0x00001000U)
#endif
#if !$L011$ && !$L021$
#define GPIOH_BASE            (IOPPERIPH_BASE + 0x00001C00U)
#endif

/**
  * @}
  */
  
/** @addtogroup Peripheral_declaration
  * @{
  */  

#define TIM2                ((TIM_TypeDef *) TIM2_BASE)
#if $L071$ || $L072$ || $L073$ || $L081$ || $L082$ || $L083$
#define TIM3                ((TIM_TypeDef *) TIM3_BASE)
#endif
#if $L051$ || $L052$ || $L053$ || $L061$ ||  $L062$ || $L063$ || $L071$ || $L072$ || $L073$ || $L081$ || $L082$ || $L083$
#define TIM6                ((TIM_TypeDef *) TIM6_BASE)
#endif
#if $L071$ || $L072$ || $L073$ || $L081$ || $L082$ || $L083$
#define TIM7                ((TIM_TypeDef *) TIM7_BASE)
#endif
#define RTC                 ((RTC_TypeDef *) RTC_BASE)
#define WWDG                ((WWDG_TypeDef *) WWDG_BASE)
#define IWDG                ((IWDG_TypeDef *) IWDG_BASE)
#if $L051$ || $L052$ || $L053$ || $L061$ ||  $L062$ || $L063$ || $L071$ || $L072$ || $L073$ || $L081$ || $L082$ || $L083$
#define SPI2                ((SPI_TypeDef *) SPI2_BASE)
#endif
#define USART2              ((USART_TypeDef *) USART2_BASE)
#define LPUART1             ((USART_TypeDef *) LPUART1_BASE)
#define I2C1                ((I2C_TypeDef *) I2C1_BASE)
#if $L051$ || $L052$ || $L053$ || $L061$ ||  $L062$ || $L063$ || $L071$ || $L072$ || $L073$ || $L081$ || $L082$ || $L083$
#define I2C2                ((I2C_TypeDef *) I2C2_BASE)
#endif
#if $L071$ || $L072$ || $L073$ || $L081$ || $L082$ || $L083$
#define I2C3                ((I2C_TypeDef *) I2C3_BASE)
#endif
#if $L052$ || $L053$ || $L062$ || $L063$ || $L072$ || $L073$ || $L082$ || $L083$
#define CRS                 ((CRS_TypeDef *) CRS_BASE)
#endif
#define PWR                 ((PWR_TypeDef *) PWR_BASE)
#if $L052$ || $L053$ || $L062$ || $L063$ || $L072$ || $L073$ || $L082$ || $L083$
#define DAC                 ((DAC_TypeDef *) DAC_BASE)
#define DAC1                ((DAC_TypeDef *) DAC_BASE)
#endif
#define LPTIM1              ((LPTIM_TypeDef *) LPTIM1_BASE)
#if $L053$ || $L063$ || $L073$ || $L083$
#define LCD                 ((LCD_TypeDef *) LCD_BASE)
#endif
#if $L071$ || $L072$ || $L073$ || $L081$ || $L082$ || $L083$
#define USART4              ((USART_TypeDef *) USART4_BASE)
#define USART5              ((USART_TypeDef *) USART5_BASE)
#endif

