I-SYST/EHAL/ARM/ST/STM32L0xx/include/stm32l0xxxxx.h
/****************** TIM Instances : supporting clock division *****************/
#if $L011$ || $L021$
#define IS_TIM_CLOCK_DIVISION_INSTANCE(INSTANCE)       (((INSTANCE) == TIM2)   || \
                                                        ((INSTANCE) == TIM21))
#elif $L071$ || $L072$ || $L073$ || $L081$ || $L082$ || $L083$
#define IS_TIM_CLOCK_DIVISION_INSTANCE(INSTANCE)       (((INSTANCE) == TIM2)   || \
                                                        ((INSTANCE) == TIM3)   || \
                                                        ((INSTANCE) == TIM21)  || \
                                                        ((INSTANCE) == TIM22))
#else
#define IS_TIM_CLOCK_DIVISION_INSTANCE(INSTANCE)       (((INSTANCE) == TIM2)   || \
                                                        ((INSTANCE) == TIM21)  || \
                                                        ((INSTANCE) == TIM22))
#endif

/****** TIM Instances : supporting external clock mode 1 for ETRF input *******/
#if $L071$ || $L072$ || $L073$ || $L081$ || $L082$ || $L083$
#define IS_TIM_CLOCKSOURCE_ETRMODE1_INSTANCE(INSTANCE)   (((INSTANCE) == TIM2)   || \
                                                          ((INSTANCE) == TIM3)   || \
                                                          ((INSTANCE) == TIM21))
#else
#define IS_TIM_CLOCKSOURCE_ETRMODE1_INSTANCE(INSTANCE)   (((INSTANCE) == TIM2)   || \
                                                          ((INSTANCE) == TIM21))
#endif

/****** TIM Instances : supporting external clock mode 2 for ETRF input *******/
#if $L011$ || $L021$
#define IS_TIM_CLOCKSOURCE_ETRMODE2_INSTANCE(INSTANCE)   (((INSTANCE) == TIM2)   || \
                                                          ((INSTANCE) == TIM21))
#elif $L031$ || $L041$
#elif $L071$ || $L072$ || $L073$ || $L081$ || $L082$ || $L083$
#define IS_TIM_CLOCKSOURCE_ETRMODE2_INSTANCE(INSTANCE)   (((INSTANCE) == TIM2)   || \
                                                          ((INSTANCE) == TIM3)   || \
                                                          ((INSTANCE) == TIM21)  || \
                                                          ((INSTANCE) == TIM22))
#else
#define IS_TIM_CLOCKSOURCE_ETRMODE2_INSTANCE(INSTANCE)   (((INSTANCE) == TIM2)   || \
                                                          ((INSTANCE) == TIM21)  || \
                                                          ((INSTANCE) == TIM22))
#endif

/****************** TIM Instances : supporting external clock mode 1 for TIX inputs*/
#if $L071$ || $L072$ || $L073$ || $L081$ || $L082$ || $L083$
#define IS_TIM_CLOCKSOURCE_TIX_INSTANCE(INSTANCE)        (((INSTANCE) == TIM2)   || \
                                                          ((INSTANCE) == TIM3)   || \
                                                          ((INSTANCE) == TIM21))
#else
#define IS_TIM_CLOCKSOURCE_TIX_INSTANCE(INSTANCE)        (((INSTANCE) == TIM2)   || \
                                                          ((INSTANCE) == TIM21))
#endif

/****************** TIM Instances : supporting internal trigger inputs(ITRX) *******/
#if $L011$ || $L021$
#define IS_TIM_CLOCKSOURCE_ITRX_INSTANCE(INSTANCE)       (((INSTANCE) == TIM2)   || \
                                                          ((INSTANCE) == TIM21))
#elif $L071$ || $L072$ || $L073$ || $L081$ || $L082$ || $L083$
#define IS_TIM_CLOCKSOURCE_ITRX_INSTANCE(INSTANCE)       (((INSTANCE) == TIM2)   || \
                                                          ((INSTANCE) == TIM3)   || \
                                                          ((INSTANCE) == TIM21)  || \
                                                          ((INSTANCE) == TIM22))
#else
#define IS_TIM_CLOCKSOURCE_ITRX_INSTANCE(INSTANCE)       (((INSTANCE) == TIM2)   || \
                                                          ((INSTANCE) == TIM21)  || \
                                                          ((INSTANCE) == TIM22))
#endif

/************* TIM Instances : at least 1 capture/compare channel *************/
#if $L071$ || $L072$ || $L073$ || $L081$ || $L082$ || $L083$
#define IS_TIM_CC1_INSTANCE(INSTANCE)   (((INSTANCE) == TIM2)  || \
                                         ((INSTANCE) == TIM3)  || \
                                         ((INSTANCE) == TIM21) || \
                                         ((INSTANCE) == TIM22))
#elif $L011$ || $L021$
#define IS_TIM_CC1_INSTANCE(INSTANCE)   (((INSTANCE) == TIM2)  || \
                                         ((INSTANCE) == TIM21))
#else
#define IS_TIM_CC1_INSTANCE(INSTANCE)   (((INSTANCE) == TIM2)  || \
                                         ((INSTANCE) == TIM21) || \
                                         ((INSTANCE) == TIM22))
#endif

/************ TIM Instances : at least 2 capture/compare channels *************/
#if $L071$ || $L072$ || $L073$ || $L081$ || $L082$ || $L083$
#define IS_TIM_CC2_INSTANCE(INSTANCE)  (((INSTANCE) == TIM2)  || \
                                        ((INSTANCE) == TIM3)  || \
                                        ((INSTANCE) == TIM21) || \
                                        ((INSTANCE) == TIM22))
#elif $L011$ || $L021$
#define IS_TIM_CC2_INSTANCE(INSTANCE)  (((INSTANCE) == TIM2)  || \
                                        ((INSTANCE) == TIM21))
#else
#define IS_TIM_CC2_INSTANCE(INSTANCE)  (((INSTANCE) == TIM2)  || \
                                        ((INSTANCE) == TIM21) || \
                                        ((INSTANCE) == TIM22))
#endif

/************ TIM Instances : at least 3 capture/compare channels *************/
#if $L071$ || $L072$ || $L073$ || $L081$ || $L082$ || $L083$
#define IS_TIM_CC3_INSTANCE(INSTANCE)  (((INSTANCE) == TIM2) || \
                                        ((INSTANCE) == TIM3))
#else
#define IS_TIM_CC3_INSTANCE(INSTANCE)   ((INSTANCE) == TIM2)
#endif

/************ TIM Instances : at least 4 capture/compare channels *************/
#if $L071$ || $L072$ || $L073$ || $L081$ || $L082$ || $L083$
#define IS_TIM_CC4_INSTANCE(INSTANCE)  (((INSTANCE) == TIM2) || \
                                        ((INSTANCE) == TIM3))
#else
#define IS_TIM_CC4_INSTANCE(INSTANCE)   ((INSTANCE) == TIM2)
#endif

