I-SYST/EHAL/ARM/ST/STM32L0xx/include/stm32l0xxxxx.h
/******************** UART Instances : Asynchronous mode **********************/
#if $L011$ || $L021$ || $L031$ || $L041$
#define IS_UART_INSTANCE(INSTANCE) (((INSTANCE) == USART2) || \
                                    ((INSTANCE) == LPUART1))
#elif $L071$ || $L072$ || $L073$ || $L081$ || $L082$ || $L083$
#define IS_UART_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                    ((INSTANCE) == USART2) || \
                                    ((INSTANCE) == USART4) || \
                                    ((INSTANCE) == USART5) || \
                                    ((INSTANCE) == LPUART1))
#else
#define IS_UART_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                    ((INSTANCE) == USART2) || \
                                    ((INSTANCE) == LPUART1))
#endif

/******************** USART Instances : Synchronous mode **********************/
#if $L011$ || $L021$ 
#define IS_USART_INSTANCE(INSTANCE) (1 == 0)
#elif $L031$ || $L041$
#define IS_USART_INSTANCE(INSTANCE) ((INSTANCE) == USART2)
#elif $L071$ || $L072$ || $L073$ || $L081$ || $L082$ || $L083$
#define IS_USART_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                     ((INSTANCE) == USART2) || \
                                     ((INSTANCE) == USART4) || \
                                     ((INSTANCE) == USART5))
#else
#define IS_USART_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                     ((INSTANCE) == USART2))
#endif

/****************** USART Instances : Auto Baud Rate detection ****************/

#if $L011$ || $L021$ 
#define IS_USART_AUTOBAUDRATE_DETECTION_INSTANCE(INSTANCE) (1 == 0)
#elif $L031$ || $L041$
#define IS_USART_AUTOBAUDRATE_DETECTION_INSTANCE(INSTANCE) ((INSTANCE) == USART2)
#else
#define IS_USART_AUTOBAUDRATE_DETECTION_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                                            ((INSTANCE) == USART2))
#endif

/******************** UART Instances : Half-Duplex mode **********************/
#if $L011$ || $L021$ || $L031$ || $L041$ 
#define IS_UART_HALFDUPLEX_INSTANCE(INSTANCE)   (((INSTANCE) == USART2) || \
                                                 ((INSTANCE) == LPUART1))
#elif $L071$ || $L072$ || $L073$ || $L081$ || $L082$ || $L083$
#define IS_UART_HALFDUPLEX_INSTANCE(INSTANCE)   (((INSTANCE) == USART1) || \
                                                 ((INSTANCE) == USART2) || \
                                                 ((INSTANCE) == USART4) || \
                                                 ((INSTANCE) == USART5) || \
                                                 ((INSTANCE) == LPUART1))
#else
#define IS_UART_HALFDUPLEX_INSTANCE(INSTANCE)    (((INSTANCE) == USART1) || \
                                                  ((INSTANCE) == USART2) || \
                                                  ((INSTANCE) == LPUART1))
#endif

/******************** UART Instances : LIN mode **********************/
#if $L011$ || $L021$
#define IS_UART_LIN_INSTANCE(INSTANCE)    (1==0)
#elif $L031$ || $L041$
#define IS_UART_LIN_INSTANCE(INSTANCE)    ((INSTANCE) == USART2)
#else
#define IS_UART_LIN_INSTANCE(INSTANCE)    (((INSTANCE) == USART1) || \
                                           ((INSTANCE) == USART2))
#endif

/******************** UART Instances : Wake-up from Stop mode **********************/
#if $L011$ || $L021$ 
#define IS_UART_WAKEUP_FROMSTOP_INSTANCE(INSTANCE)   ((INSTANCE) == LPUART1)
#elif $L031$ || $L041$
#define IS_UART_WAKEUP_FROMSTOP_INSTANCE(INSTANCE)   (((INSTANCE) == USART2) || \
                                                      ((INSTANCE) == LPUART1))													  
#else
#define IS_UART_WAKEUP_FROMSTOP_INSTANCE(INSTANCE)   (((INSTANCE) == USART1) || \
                                                      ((INSTANCE) == USART2) || \
                                                      ((INSTANCE) == LPUART1))
#endif
/****************** UART Instances : Hardware Flow control ********************/
#if $L011$ || $L021$ || $L031$ || $L041$ 
#define IS_UART_HWFLOW_INSTANCE(INSTANCE) (((INSTANCE) == USART2) || \
                                           ((INSTANCE) == LPUART1))
#elif $L071$ || $L072$ || $L073$ || $L081$ || $L082$ || $L083$
#define IS_UART_HWFLOW_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                           ((INSTANCE) == USART2) || \
                                           ((INSTANCE) == USART4) || \
                                           ((INSTANCE) == USART5) || \
                                           ((INSTANCE) == LPUART1))
#else
#define IS_UART_HWFLOW_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                           ((INSTANCE) == USART2) || \
                                           ((INSTANCE) == LPUART1))
#endif

/********************* UART Instances : Smard card mode ***********************/
#if $L011$ || $L021$ || $L031$ || $L041$ 
#define IS_SMARTCARD_INSTANCE(INSTANCE) ((INSTANCE) == USART2)
#else
#define IS_SMARTCARD_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                         ((INSTANCE) == USART2))
#endif

/*********************** UART Instances : IRDA mode ***************************/
#if $L011$ || $L021$ || $L031$ || $L041$ 
#define IS_IRDA_INSTANCE(INSTANCE) ((INSTANCE) == USART2)
#else
#define IS_IRDA_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                    ((INSTANCE) == USART2))
#endif

/******************** LPUART Instance *****************************************/
#define IS_LPUART_INSTANCE(INSTANCE)    ((INSTANCE) == LPUART1)

/****************************** IWDG Instances ********************************/
#define IS_IWDG_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == IWDG)

#if $L052$ || $L053$ || $L062$ || $L063$ || $L072$ || $L073$ || $L082$ || $L083$
/****************************** USB Instances ********************************/
#define IS_USB_ALL_INSTANCE(INSTANCE) ((INSTANCE) == USB)

#endif
/****************************** WWDG Instances ********************************/
#define IS_WWDG_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == WWDG)

#if $L053$ || $L063$ || $L073$ || $L083$
/****************************** LCD Instances ********************************/
#define IS_LCD_ALL_INSTANCE(INSTANCE) ((INSTANCE) == LCD)

#endif
/**
  * @}
  */

/******************************************************************************/
/*  For a painless codes migration between the STM32L0xx device product       */
/*  lines, the aliases defined below are put in place to overcome the         */
/*  differences in the interrupt handlers and IRQn definitions.               */
/*  No need to update developed interrupt code when moving across             */ 
/*  product lines within the same STM32L0 Family                              */
/******************************************************************************/

