I-SYST/EHAL/ARM/ST/STM32L0xx/include/stm32l0xxxxx.h
/* Aliases for __IRQn */

#if $L011$|| $L031$|| $L051$|| $L071$ 
#define RNG_LPUART1_IRQn               LPUART1_IRQn
#define AES_LPUART1_IRQn               LPUART1_IRQn
#define AES_RNG_LPUART1_IRQn           LPUART1_IRQn
#elif $L052$ || $L053$|| $L072$|| $L073$
#define LPUART1_IRQn                   RNG_LPUART1_IRQn
#define AES_LPUART1_IRQn               RNG_LPUART1_IRQn
#define AES_RNG_LPUART1_IRQn           RNG_LPUART1_IRQn
#elif $L021$ || $L041$ ||  $L061$ || $L081$
#define RNG_LPUART1_IRQn               AES_LPUART1_IRQn
#define LPUART1_IRQn                   AES_LPUART1_IRQn
#define AES_RNG_LPUART1_IRQn           AES_LPUART1_IRQn
#elif $L062$ || $L063$ || $L082$ || $L083$
#define LPUART1_IRQn                   AES_RNG_LPUART1_IRQn
#define AES_LPUART1_IRQn               AES_RNG_LPUART1_IRQn
#define RNG_LPUART1_IRQn               AES_RNG_LPUART1_IRQn
#else
#error
#endif
#if $L011$ || $L021$ || $L031$ || $L041$
#define RCC_CRS_IRQn                   RCC_IRQn
#elif $L051$ || $L061$ || $L071$ || $L081$
#define TIM6_DAC_IRQn                  TIM6_IRQn
#define RCC_CRS_IRQn                   RCC_IRQn
#else                                  
#define TIM6_IRQn                      TIM6_DAC_IRQn
#define RCC_IRQn                       RCC_CRS_IRQn
#endif

/* Aliases for __IRQHandler */
#if $L011$|| $L031$ || $L051$ || $L071$
#define RNG_LPUART1_IRQHandler         LPUART1_IRQHandler
#define AES_LPUART1_IRQHandler         LPUART1_IRQHandler
#define AES_RNG_LPUART1_IRQHandler     LPUART1_IRQHandler
#elif $L052$ || $L053$ || $L072$ || $L073$
#define LPUART1_IRQHandler             RNG_LPUART1_IRQHandler
#define AES_LPUART1_IRQHandler         RNG_LPUART1_IRQHandler
#define AES_RNG_LPUART1_IRQHandler     RNG_LPUART1_IRQHandler
#elif $L021$ || $L041$ || $L061$ || $L081$
#define LPUART1_IRQHandler             AES_LPUART1_IRQHandler
#define RNG_LPUART1_IRQHandler         AES_LPUART1_IRQHandler
#define AES_RNG_LPUART1_IRQHandler     AES_LPUART1_IRQHandler
#elif $L062$ || $L063$ || $L082$ || $L083$
#define LPUART1_IRQHandler             AES_RNG_LPUART1_IRQHandler
#define RNG_LPUART1_IRQHandler         AES_RNG_LPUART1_IRQHandler
#define AES_LPUART1_IRQHandler         AES_RNG_LPUART1_IRQHandler
#else
#error
#endif
#if $L011$ || $L021$ || $L031$ || $L041$ || $L051$ || $L061$ || $L071$ || $L081$
#define TIM6_DAC_IRQHandler            TIM6_IRQHandler
#define RCC_CRS_IRQHandler             RCC_IRQHandler
#else
#define TIM6_IRQHandler                TIM6_DAC_IRQHandler
#define RCC_IRQHandler                 RCC_CRS_IRQHandler
#endif

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* __$PRODUCTNAME_UC$_H */



/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
